src/poetry_as_lossy_compression.org
#+title: Poetry is Lossy Compression of Human Emotions
#+author: Alex Drysdale
#+date: <2025-06-17>
#+export_date: Tue, 17 Jun 2025 00:00:01 GMT
#+filetags: :poetry:

* The History of the Human Heart

I read a quote from the contemporary American poet Billy Collins:

#+begin_quote
poetry is incontestably the only history we have
of human emotion. It’s the history of the human heart.
#+end_quote

and immediately thought, how is this possible?

I know it to be true that reading poetry can stir up a wealth of emotions and a connection to another that mere prose cannot do.
But the question is, how can something as complex, ephemeral and intangible as human emotion be captured, transmitted and received by another human?

This made me think of poetry as a lossy compression algorithm [fn:1] for human emotions.
That is,

1. The poet encodes (compresses) emotions into a poem.
2. The poem is transferred to another person - via print, the web or orally.
3. When the poem is read or heard by another person, the emotions are evoked in the reader/listener (decoding/decompression).

Thus the loss can be thought of as the difference in the emotions conceived by the poet to those evoked by the reader/listener.
Hence loss occurs in (at least) 3 places:

1. The poet.
2. The format of the poem.
3. The reader/listener.

Essentially, we can deduce from this the following:
1. What makes a good poet (in the context of emotion transmission) is minimal loss in expressing their emotions as a poem.
2. What makes a good transmission (print, oral reading, etc.) is expression of the emotions in the poem is faithfully retained.
3. What makes a good reader/listener is being able to understand and feel the emotions evoked by the poem.


* Where the compression of emotions differs to the compression of files

Building on this idea, the loss introduced by each of the stages is +sometimes+ often a desired effect - unlike file compression.

If a file compression, transmission or decompression algorithm started randomly flipping bits of information, it would likely be completely unusable.
The compressed files would be decompressed into complete garbage rending them completely nonsensical.

With poetry, however, this imperfection is what makes poetry so powerful.

1. An poet leaving a healthy dose of ambiguity in a poem allows a wider pool emotions to be (unconsciously) selected by the reader/listener which likely results in evoking more personable and relocatable emotions.
2. A speaker that imparts their own emotional interpretation onto the poem adds an extra layer of complexity to the final result - potentially deepening our own (or even the poet's!) understanding of the poem.
3. Similarly to the above, an imperfect reader/listener is what makes poetry so reflective and insightful.

Which raises the question, how can we reduce the emotion loss? As a reader/listener, all you have control of is the decompression algorithm.

* How to reduce decoding loss?

From this we can say that understanding more about the poet's life, the historical/social/political context of poem and understanding the reasoning behind the poetic techniques used allows us more accurately decode the poet's original emotions when writing the poem.

But that's only really a requirement when the poem evokes no emotional response - other than confusion.
In those instances, you (the reader/listener) lack the abilities to decode this poem into your own emotions - this could equally be a fault in the poet or the transmission.
In this instance, the lossy aspect of the emotional encoding/decoding is more akin to file transmission.

To take it back to file compression, a compression algorithm maps from the space all files to a latent space of compressed files.
The decompression algorithm, naturally, maps from this latent space of compressed files to the space of all files.
Taking a compressed file and randomly flipping bits is akin to moving the compressed file to a different point in the latent space.
The decompression is likely to not end up being a usable file as only a small subset of all files are "usable" files.

With poetry, there is really no equivalent of a "usable" subset of human emotion.
Even the feeling of confusion could be what the poet intended.
All that is improved upon when becoming a "better" reader of poetry is a more faithful reconstruction of the poet’s emotions, but crucially, enjoyment does not require it.
Even if a poem or poet doesn't "speak to you" (encode their emotions into a poem that is meaningfully decoded by yourself) then there are plenty of others that will be meaningful.

* Is poetry a history of human emotions?

Collins’ claim begins to make sense when we see poems as time capsules of compressed feeling.
A medieval lament, a war-time sonnet, a protest haiku—all are all encoded with emotions that might today be decoded in ways their writers never imagined.
Yet this evolution isn’t a flaw; it’s proof that poetry survives by adapting.
The "loss" of original intent becomes a bridge to new meaning, connecting us not to a static past but to the raw, universal fact that /someone, somewhere, felt something deeply enough to try to preserve it/.

In this light, poetry isn’t just a history of emotion - it’s a mirror showing yourself projected into the past.
The cracks in its reflection only help us see ourselves more clearly.

* Footnotes

[fn:1] Similar to how a JPEG takes an a high resolution image and compresses it into something lower resolution but a lot smaller in file size - with minimal reduction in the perceived quality of the image. The true, original image, can never be reconstructed which is what makes JPEG compression "lossy".
 
