docs/poetry_as_lossy_compression.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Poetry is Lossy Compression of Human Emotions</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"href="resources/org.css"type="text/css" /><header><a href="index.html">Home</a>&emsp;<a href="about.html">About Me</a>&emsp;<a href="https://github.com/abdrysdale/abdrysdale.github.io">Source</a>&emsp;<a href="sitemap.html">Sitemap</a>&emsp;<a href="feed.xml">RSS</a></header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Poetry is Lossy Compression of Human Emotions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4bce0d4">The History of the Human Heart</a></li>
<li><a href="#org52a51f0">Where the compression of emotions differs to the compression of files</a></li>
<li><a href="#org3d196ed">How to reduce decoding loss?</a></li>
<li><a href="#orgff01126">Is poetry a history of human emotions?</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4bce0d4" class="outline-2">
<h2 id="org4bce0d4">The History of the Human Heart</h2>
<div class="outline-text-2" id="text-org4bce0d4">
<p>
I read a quote from the contemporary American poet Billy Collins:
</p>

<blockquote>
<p>
poetry is incontestably the only history we have
of human emotion. It’s the history of the human heart.
</p>
</blockquote>

<p>
and immediately thought, how is this possible?
</p>

<p>
I know it to be true that reading poetry can stir up a wealth of emotions and a connection to another that mere prose cannot do.
But the question is, how can something as complex, ephemeral and intangible as human emotion be captured, transmitted and received by another human?
</p>

<p>
This made me think of poetry as a lossy compression algorithm <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> for human emotions.
That is,
</p>

<ol class="org-ol">
<li>The poet encodes (compresses) emotions into a poem.</li>
<li>The poem is transferred to another person - via print, the web or orally.</li>
<li>When the poem is read or heard by another person, the emotions are evoked in the reader/listener (decoding/decompression).</li>
</ol>

<p>
Thus the loss can be thought of as the difference in the emotions conceived by the poet to those evoked by the reader/listener.
Hence loss occurs in (at least) 3 places:
</p>

<ol class="org-ol">
<li>The poet.</li>
<li>The format of the poem.</li>
<li>The reader/listener.</li>
</ol>

<p>
Essentially, we can deduce from this the following:
</p>
<ol class="org-ol">
<li>What makes a good poet (in the context of emotion transmission) is minimal loss in expressing their emotions as a poem.</li>
<li>What makes a good transmission (print, oral reading, etc.) is expression of the emotions in the poem is faithfully retained.</li>
<li>What makes a good reader/listener is being able to understand and feel the emotions evoked by the poem.</li>
</ol>
</div>
</div>
<div id="outline-container-org52a51f0" class="outline-2">
<h2 id="org52a51f0">Where the compression of emotions differs to the compression of files</h2>
<div class="outline-text-2" id="text-org52a51f0">
<p>
Building on this idea, the loss introduced by each of the stages is <del>sometimes</del> often a desired effect - unlike file compression.
</p>

<p>
If a file compression, transmission or decompression algorithm started randomly flipping bits of information, it would likely be completely unusable.
The compressed files would be decompressed into complete garbage rending them completely nonsensical.
</p>

<p>
With poetry, however, this imperfection is what makes poetry so powerful.
</p>

<ol class="org-ol">
<li>An poet leaving a healthy dose of ambiguity in a poem allows a wider pool emotions to be (unconsciously) selected by the reader/listener which likely results in evoking more personable and relocatable emotions.</li>
<li>A speaker that imparts their own emotional interpretation onto the poem adds an extra layer of complexity to the final result - potentially deepening our own (or even the poet's!) understanding of the poem.</li>
<li>Similarly to the above, an imperfect reader/listener is what makes poetry so reflective and insightful.</li>
</ol>

<p>
Which raises the question, how can we reduce the emotion loss? As a reader/listener, all you have control of is the decompression algorithm.
</p>
</div>
</div>
<div id="outline-container-org3d196ed" class="outline-2">
<h2 id="org3d196ed">How to reduce decoding loss?</h2>
<div class="outline-text-2" id="text-org3d196ed">
<p>
From this we can say that understanding more about the poet's life, the historical/social/political context of poem and understanding the reasoning behind the poetic techniques used allows us more accurately decode the poet's original emotions when writing the poem.
</p>

<p>
But that's only really a requirement when the poem evokes no emotional response - other than confusion.
In those instances, you (the reader/listener) lack the abilities to decode this poem into your own emotions - this could equally be a fault in the poet or the transmission.
In this instance, the lossy aspect of the emotional encoding/decoding is more akin to file transmission.
</p>

<p>
To take it back to file compression, a compression algorithm maps from the space all files to a latent space of compressed files.
The decompression algorithm, naturally, maps from this latent space of compressed files to the space of all files.
Taking a compressed file and randomly flipping bits is akin to moving the compressed file to a different point in the latent space.
The decompression is likely to not end up being a usable file as only a small subset of all files are "usable" files.
</p>

<p>
With poetry, there is really no equivalent of a "usable" subset of human emotion.
Even the feeling of confusion could be what the poet intended.
All that is improved upon when becoming a "better" reader of poetry is a more faithful reconstruction of the poet’s emotions, but crucially, enjoyment does not require it.
Even if a poem or poet doesn't "speak to you" (encode their emotions into a poem that is meaningfully decoded by yourself) then there are plenty of others that will be meaningful.
</p>
</div>
</div>
<div id="outline-container-orgff01126" class="outline-2">
<h2 id="orgff01126">Is poetry a history of human emotions?</h2>
<div class="outline-text-2" id="text-orgff01126">
<p>
Collins’ claim begins to make sense when we see poems as time capsules of compressed feeling.
A medieval lament, a war-time sonnet, a protest haiku—all are all encoded with emotions that might today be decoded in ways their writers never imagined.
Yet this evolution isn’t a flaw; it’s proof that poetry survives by adapting.
The "loss" of original intent becomes a bridge to new meaning, connecting us not to a static past but to the raw, universal fact that <i>someone, somewhere, felt something deeply enough to try to preserve it</i>.
</p>

<p>
In this light, poetry isn’t just a history of emotion - it’s a mirror showing yourself projected into the past.
The cracks in its reflection only help us see ourselves more clearly.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Similar to how a JPEG takes an a high resolution image and compresses it into something lower resolution but a lot smaller in file size - with minimal reduction in the perceived quality of the image. The true, original image, can never be reconstructed which is what makes JPEG compression "lossy".
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2025-06-17 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
